use BookShop;



insert into Genres (GenreName, id_genre) values
('Фантастика', 1 ),
('Роман' ,2),
('Детектив',3 );

insert into Authors (AuthorName, Country, id_author) values
('Аркадий и Борис Стругацкие','Россия', 11 ),
('Жюль Верн','Франция' , 12 ),
('Марк Твен' ,'США', 13 ),
('Стивен Кинг','США', 14 ),
('Агата Кристи','Великобритания', 15  );

insert into Books (BookName, Price, id_book, quanity) values
('Понедельник начинается в субботу',400 , 101 , 30), # 11
('Пикник на обочине',600, 102 , 50 ),
('Трудно быть богом',500, 103 , 25 ),
('Град обреченный' ,500, 104, 15 ),
('Обитаемый остров', 450, 105, 20 ),
('Улитка на склоне' , 450, 106, 25 ), 
('20 тысяч лье од водой' ,500,107, 100 ), # 12
('Необитаемый остров' ,600 , 108, 90) ,
('Дети капитана Гранта' ,500 ,109, 60),
('Путешествие к центру Земли',450 , 110, 50 ),
('Приключения Тома Сойера',500, 111, 75 ), # 13
('Принц и нищий',400, 112 , 35 ),
('Приключения Герберта Флинна' ,450, 113, 25 ),
('Янки при дворе короля Артура' ,400, 114, 40 ),
('Мгла', 600, 115, 90), # 14
('Сияние', 550, 116, 100), 
('Оно', 550, 117, 120),
('Зеленая миля', 650, 118, 150),
('Убийство в Восточном экспрессе ',650,119, 60 ), # 15
('Смерть на Ниле ',450, 120 , 30),
('Вечеринка на Хэллоуин ',400, 121, 25 ),
('Загадочное происшествие ',500 ,122, 35);

insert into Workers (SurName, NamePerson,  Patronymic, Sex, Salary ,id_worker) values
('Богданов', 'Вячеслав', 'Олегович', 0, 25000, 201),
('Хромов', 'Павел', 'Андреевич', 0,27500, 202),
('Нефедова', 'Анастасия', 'Владимировна', 1, 27500, 203 ),
('Зенина', 'Елена', 'Федоровна', 1, 30000, 204 ),
('Пшеничников', 'Максим', 'Владимирович',0, 27500, 205 ),
('Поминов', 'Владислав', 'Игоревич', 0, 25000, 206 );



insert into Genres_Authors (genre, author) values
( 1, 11 ),
( 1, 12 ),
( 2, 13 ),
( 2, 14 ),
( 3, 15 )
;

insert into Authors_Books (author, book) values
(11, 101),
(11, 102),
(11, 103),
(11, 104),
(11, 105),
(11, 106),
(12, 107),
(12, 108),
(12, 109),
(12, 110),
(13, 111),
(13, 112),
(13, 113),
(13, 114),
(14, 115),
(14, 116),
(14, 117),
(14, 118),
(15, 119),
(15, 120),
(15, 121),
(15, 122)
;

insert into Orders (id_order, id_curier, sum, orderdate) values
(301, 201, 1000, 20240901 ),
(302, 206, 900, 20240903),
(303, 201, 1500, 20240905)
;

INSERT INTO OrderBook (id_order, id_book, quantity) VALUES
(301, 109, 2),
(302, 121, 2),
(302, 122, 2),
(303, 101, 2),
(303, 102, 2),
(303, 103, 2);


